app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 980190962]]
SELECT  "users".* FROM "users" WHERE "users"."stu_num" = ? LIMIT 1  [["stu_num", "980190962"]]
SELECT "notes".* FROM "notes" WHERE "notes"."article_id" = ?  [["article_id", 980190962]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 980190962]]
---
  def cutlist
    @article = Article.find(params[:article_id].to_i)
    if @article.nil?
       render text: 'Article not exist', status: 404
    end
    suc = false
#    puts "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&7"
    #puts request.body.string
   # puts JSON.parse(request.body.string)
  #  puts  @users_id["uids"]
 #   puts "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    @users_id = JSON.parse(request.body.string)
    puts  @users_id["uids"]
    @users_id["uids"].each{|temp_id|
                            puts temp_id
                            puts @article.id
                            user = User.find_by stu_num: temp_id
                            puts user.id
                            find = false
                            puts @article.notes.length
                            @article.notes.each{|temp_note| if temp_note.user_id == user.id
                                                                find = true
                                                                temp_note.destroy

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
SELECT "articles".* FROM "articles" WHERE "articles"."club_id" = ?  [["club_id", 980190962]]
SELECT  `notes`.* FROM `notes` WHERE (article_id = 980190962 AND user_id = 980190962) LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "notes" ON "users"."id" = "notes"."user_id" WHERE "notes"."article_id" = ?  [["article_id", 980190962]]
---
    def list
     clu = Club.where(club_account: request.headers["uid"]).take
     state = 200
     puts clu.articles.length
     art = clu.articles.find(params[:article_id].to_i)
     if art.nil?
        state = 404
     else

    s = []
    art.users.each{|a| s<<{:uid => a.stu_num,name: a.name,phone_num: a.phone_num,email: a.email,time: Note.where("article_id = ? AND user_id = ?",params[:article_id].to_i,a.id).take.created_at,content: Note.where("article_id = ? AND user_id = ?",params[:article_id].to_i,a.id).take.content}}

SELECT  `articles`.* FROM `articles`  ORDER BY `articles`.`created_at` DESC LIMIT 5
---
  def abstracts
    a = []
    x = params[:page_id].to_i
    if (x<1)
      respond_to do |format|
        format.html { render :json=>{txt: "page_id minus"}.to_json, :status => 404}
      end
    end
    if x>1
      x = (x-1)*5
    else
      x = 1
    end
  # y = Article.last.id.to_i
   # @abstracts = Article.find([x,x+9])
    if x == 1
      if params[:kind].to_i !=2 and  params[:club_id]!="-1"
         #puts params[:club_id]
         p = Article.where(type: params[:kind].to_i , club_id: (Club.find_by club_account: params[:club_id]).id).order(created_at: :desc).limit(5)
      end
      if params[:kind].to_i !=2 and  params[:club_id]=="-1"
         puts params[:kind].to_i
        p = Article.where(type: params[:kind].to_i).order(created_at: :desc).limit(5)
         puts p.length

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 2]]
---
       format.html { render :json => {:txt => "Not Record"} ,:status => 404}
       end
    else
       p.each{|t| a<<{:article_id => t.id,:article_title => t.title,:article_abstract => t.abstract, :head_url => t.club.head_url, :article_type => t.type, :club_name => Club.find(t.club_id).name, :time => t.created_at.localtime.to_s} }

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def detail
   if (Article.exists?(params[:article_id].to_i)== false)
       respond_to do |format|
        format.html { render :json=>{:txt => params[:article_id]}.to_json, :status => 404}
      end
    end
   begin
   @detail =  Article.find(params[:article_id].to_i)

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."club_id" = ? AND "articles"."id" = ? LIMIT 1  [["club_id", 980190962], ["id", 980190962]]
---
  def show

          clu = Club.where(club_account: request.headers["uid"]).take
          state = 200
          art = clu.articles.find(params[:article_id].to_i)

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
INSERT INTO "articles" ("title", "content", "abstract", "club_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdasda"], ["content", "asdasdasd"], ["abstract", "ajsdhjasdhka"], ["club_id", 980190962], ["created_at", "2015-11-06 15:37:27.680164"], ["updated_at", "2015-11-06 15:37:27.680164"]]
---
  def create

    @article = Article.new
    @body = JSON.parse(request.body.string)
    @article.title = @body["title"]
    @article.content = @body["content"]
    @article.abstract = @body["abstract"]
    @article.type = @body["type"]
    @article.deadline = @body["date"]
    clu = Club.find_by club_account: request.headers["uid"]
    @article.club_id = clu.id
    respond_to do |format|
      if @article.save

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."club_id" = ? AND "articles"."id" = ? LIMIT 1  [["club_id", 980190962], ["id", 980190962]]
UPDATE "articles" SET "title" = ?, "content" = ?, "abstract" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "asdasda"], ["content", "asdasdasd"], ["abstract", "ajsdhjasdhka"], ["updated_at", "2015-11-06 15:41:06.494705"], ["id", 980190962]]
---
  def update
   state = 200
   clu = Club.where(club_account: request.headers["uid"]).take
   sss = {}
   @body = JSON.parse(request.body.string)

   sss[:title] = @body["title"]
   sss[:content] = @body["content"]
   sss[:abstract] = @body["abstract"]
   sss[:club_id] = clu.id
   puts sss[:title]
   puts sss[:content]
   puts sss[:abstract]
   puts sss[:club_id]
   @article = clu.articles.find(params[:article_id].to_i)
   if @article.nil?
      state = 401
   end
    respond_to do |format|
      if (state == 200)&&@article.update(sss)

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."club_id" = ? AND "articles"."id" = ? LIMIT 1  [["club_id", 980190962], ["id", 980190962]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 980190962]]
---
  def destroy
    clu = Club.where(club_account: request.headers["uid"]).take
    state = 200
    @article = clu.articles.find(params[:article_id].to_i)

    if @article.nil?
       state = 401
    end
    respond_to do |format|
      if (status == 200)&& @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_article
      @article = Article.find(params[:article_id].to_i)