app/controllers/clubs_controller.rb

  def login
    @club = Club.find_by club_account: params[:uid]
    if !@club.nil? and params[:passwd] == @club.password
      @club.update(log_num: rand(10000000))
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
UPDATE "clubs" SET "log_num" = ?, "updated_at" = ? WHERE "clubs"."id" = ?  [["log_num", 2332910], ["updated_at", "2015-11-06 13:11:43.194517"], ["id", 980190962]]

  def getabstracts
    a = []
    @club = Club.where(club_account: params[:uid]).take
    puts "-----------------------"
    puts @club.id
    x = params[:page_id].to_i
    if x>1
      x = (x-1)*5
    else
      x = 0
    end

	@articles = @club.articles.reverse
        puts @articles.length
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
SELECT "articles".* FROM "articles" WHERE "articles"."club_id" = ?  [["club_id", 980190962]]

  def logout
          head = request.headers["uid"]
          Club.where(club_account: head).exists?
          @club = Club.where(club_account: head).take
          @club.update(log_num: nil)
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."club_account" = ? LIMIT 1  [["club_account", "lingfengshe"]]
SELECT  1 AS one FROM `clubs` WHERE (`clubs`.`club_account` = BINARY 'lingfengshe' AND `clubs`.`id` != 980190962) LIMIT 1
UPDATE "clubs" SET "log_num" = ?, "updated_at" = ? WHERE "clubs"."id" = ?  [["log_num", nil], ["updated_at", "2015-11-06 13:39:04.542626"], ["id", 980190962]]

  def index
    @clubs = Club.all
---
SELECT "clubs".* FROM "clubs"

  def create
    @club = Club.new(club_params)

    respond_to do |format|
      if @club.save
---
INSERT INTO "clubs" ("name", "password", "introduction", "head_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "MyString"], ["password", "MyString"], ["introduction", "MyString"], ["head_url", "MyString"], ["created_at", "2015-10-27 08:06:01.513569"], ["updated_at", "2015-10-27 08:06:01.513569"]]

  def destroy
    @club.destroy
---
DELETE FROM "clubs" WHERE "clubs"."id" = ?  [["id", 980190962]]

    def set_club
      @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 980190962]]