app/controllers/notes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."stu_num" = ? LIMIT 1  [["stu_num", "13061196"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT 1  [["title", "欢迎大家"]]
INSERT INTO "notes" ("user_id", "article_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 980190962], ["article_id", 980190962], ["content", "asdsadda"], ["created_at", "2015-11-06 14:15:11.917606"], ["updated_at", "2015-11-06 14:15:11.917606"]]
---
  def create
    @note = Note.new
    usr = User.where(stu_num: request.headers["uid"]).take
    article = Article.where(title: '欢迎大家').take

    @note.user_id = usr.id
    @note.article_id = params[:article_id].to_i
    @note.content = params[:content]

    respond_to do |format|
      if @note.save