app/controllers/users_controller.rb

  def register

#    puts user_params

    @user = User.new
    @user.name = params[:name]
    @user.stu_num = params[:uid]
    @user.phone_num = params[:phone_num]
    @user.password = params[:passwd]
	@user.email = params[:email]
	@user.user_head = "http://7xob9u.com1.z0.glb.clouddn.com/defaultHead.jpg"
#    puts @user.password
    if @user.save
---
INSERT INTO "users" ("name", "stu_num", "phone_num", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "wk"], ["stu_num", "11111111"], ["phone_num", "11111111111"], ["password", "123456"], ["created_at", "2015-11-06 08:35:11.073217"], ["updated_at", "2015-11-06 08:35:11.073217"]]

  def login
#    @user = User.find_by stu_num: env["HTTP_UID"].to_i

    @user = User.find_by stu_num: request.headers[:uid]
---
SELECT  "users".* FROM "users" WHERE "users"."stu_num" = ? LIMIT 1  [["stu_num", "13061196"]]

  def logout
          head = request.headers["uid"]

          @user = User.where(stu_num: head).take
          @user.update(log_num: nil)
---
SELECT  "users".* FROM "users" WHERE "users"."stu_num" = ? LIMIT 1  [["stu_num", "13061196"]]
UPDATE "users" SET "log_num" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["log_num", nil], ["updated_at", "2015-11-06 12:51:25.771915"], ["id", 980190962]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password", "phone_num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["password", "MyString"], ["phone_num", "MyString"], ["created_at", "2015-10-27 08:06:01.294608"], ["updated_at", "2015-10-27 08:06:01.294608"]]